Revit 2026 API

# UpdaterRegistryEnableUpdater Method

---

Enables the updater.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void EnableUpdater(
	UpdaterId id
)
```
```vb
Public Shared Sub EnableUpdater (
	id As UpdaterId
)
```
```cpp
public:
static void EnableUpdater(
	UpdaterId^ id
)
```
```fsharp
static member EnableUpdater :
        id : UpdaterId -> unit
```

#### Parameters

id UpdaterId
     The updater id.

| Exception | Condition |
| --- | --- |
| ArgumentException | Updater with this Id is not currently registered in Revit. |
| ArgumentNullException | A non-optional argument was null |

Even when an updater is enabled it could still be suspended for misbehaving, in which case it would not be executed regardless of its enable/disable status.

#### Reference

UpdaterRegistry Class

Autodesk.Revit.DB Namespace